Revit 2027 API
FilteredWorksetCollector.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<Workset> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of Workset)
public:
virtual IEnumerator<Workset^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<Workset>
override GetEnumerator : unit -> IEnumerator<Workset>
Return Value
IEnumerator<Workset>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
FilteredWorksetCollector Class
Autodesk.Revit.DB Namespace